[
  "DNA stands for Deoxyribonucleic Acid.",
  "The human body contains approximately 37.2 trillion cells.",
  "Photosynthesis occurs in the chloroplasts of plant cells.",
  "The smallest bone in the human body is the stapes in the ear.",
  "Antibiotics only work against bacterial infections, not viruses.",
  "The genetic code of all living organisms is made up of only four nucleotides: A, T, G, and C.",
  "Mitochondria are known as the powerhouses of the cell.",
  "Red blood cells lack a nucleus to make room for more hemoglobin.",
  "Humans share approximately 60% of their DNA with bananas.",
  "The brain is about 75% water.",
  "An adult human has 206 bones in their body.",
  "A giraffe's tongue is around 20 inches long.",
  "A blue whale's heart can weigh as much as a small car.",
  "The fastest land animal is the cheetah, reaching speeds up to 70 mph.",
  "Octopuses have three hearts.",
  "Fungi are more closely related to animals than to plants.",
  "A chameleon's tongue can be twice the length of its body.",
  "Penguins can drink salt water because they have a gland that filters out the salt.",
  "There are more microorganisms in a teaspoon of soil than there are people on Earth.",
  "The fingerprints of a koala are so indistinguishable from humans that they can confuse crime scene investigations.",
  "Sharks existed before trees.",
  "A jellyfish is about 95% water.",
  "Elephants are the only mammals that can't jump.",
  "An ant can lift 50 times its own body weight.",
  "There are approximately 86 billion neurons in the human brain.",
  "The heart beats about 100,000 times a day.",
  "Hummingbirds are the only birds that can fly backward.",
  "The wingspan of a wandering albatross can reach 12 feet.",
  "Polar bears have black skin under their white fur.",
  "Sloths can take up to a month to digest their food.",
  "Bacteria reproduce through binary fission, splitting into two identical cells.",
  "A single teaspoon of honey represents the life work of 12 bees.",
  "An ostrich's eye is bigger than its brain.",
  "Cows have four stomach compartments to digest food.",
  "Coral reefs support 25% of all marine life.",
  "A group of flamingos is called a flamboyance.",
  "The skin is the largest organ in the human body.",
  "An earthworm has five hearts.",
  "The average lifespan of a red blood cell is about 120 days.",
  "The Arctic Tern migrates over 25,000 miles a year, the longest migration of any animal.",
  "A platypus lays eggs but is a mammal.",
  "The only natural predators of the great white shark are orcas.",
  "Butterflies taste with their feet.",
  "A single strand of spider silk is stronger than steel of the same diameter.",
  "Seahorses are the only species in which the male carries and gives birth to offspring.",
  "Bats are the only mammals capable of sustained flight.",
  "Some species of frogs can survive being frozen during the winter.",
  "There are more stars in the universe than grains of sand on all the Earth's beaches.",
  "Honey never spoils and has been found in ancient Egyptian tombs still edible.",
  "The eyes of a giant squid are the size of basketballs.",
  "Antarctica is the only continent without native reptiles or amphibians.",
  "All clownfish are born male; some become female to reproduce.",
  "The tardigrade, also known as the water bear, can survive extreme environments, including space.",
  "A group of owls is called a parliament.",
  "The electric eel can generate an electric charge of up to 600 volts.",
  "A dog's sense of smell is 10,000 to 100,000 times more sensitive than a human's.",
  "Whales can hold their breath for up to 90 minutes.",
  "Bananas are berries, but strawberries are not.",
  "The human nose can detect over 1 trillion scents.",
  "The poison dart frog's skin contains enough toxin to kill 10 adult humans.",
  "Caterpillars have up to 4,000 muscles in their bodies.",
  "The world's smallest bird is the bee hummingbird, native to Cuba.",
  "Starfish can regenerate lost arms.",
  "Male lions sleep up to 20 hours a day.",
  "The largest flower in the world, Rafflesia arnoldii, can grow up to 3 feet in diameter.",
  "The lifespan of a housefly is about 28 days.",
  "Snakes can sense heat with special pits on their faces.",
  "Birds have hollow bones to make them lightweight for flight.",
  "Bees communicate with each other through a unique dance called the waggle dance.", 
  "Cuttlefish can change their skin color and texture to blend into their surroundings.",
  "The heart of a shrimp is located in its head.",
  "The average human body contains about 5 liters of blood.",
  "Kangaroos cannot walk backward.",
  "A group of jellyfish is called a smack.",
  "Dolphins have names for each other, using unique whistles to communicate.",
  "The poison of a box jellyfish can cause heart failure within minutes.",
  "Crocodiles can go for months without eating.",
  "The fastest muscle in the body is the orbicularis oculi, used to blink.",
  "Owls can rotate their heads up to 270 degrees.",
  "The praying mantis is the only insect that can turn its head.",
  "The tongue of a blue whale weighs as much as an elephant.",
  "A snail can sleep for up to three years.",
  "The mantis shrimp can punch with the force of a bullet.",
  "Giraffes only need 5 to 30 minutes of sleep per day.",
  "A starfish has no brain but uses its nerve net to sense its environment.",
  "Sea otters hold hands while sleeping to stay together.",
  "The fingerprints of a tiger are as unique as a human's.",
  "Penguins propose to their mates with a pebble.",
  "An octopus has three hearts and blue blood.",
  "The blue morpho butterfly's wings appear blue due to microscopic scales that reflect light.",
  "A group of porcupines is called a prickle.",
  "The largest living structure on Earth is the Great Barrier Reef.",
  "Albatrosses can fly thousands of miles without landing.",
  "Some species of sharks can live for over 500 years.",
  "Axolotls can regenerate their limbs, heart, and spinal cord.",
  "Sea cucumbers can eject their internal organs to defend themselves.",
  "Bearded dragons wave to show submission.",
  "The tree kangaroo lives in trees and hops like a kangaroo.",
  "Jellyfish have been around for over 500 million years.",
  "A newborn kangaroo is the size of a jellybean.",
  "The poison of a golden poison dart frog can kill up to 20 humans.",
  "Lobsters can live for over 100 years.",
  "The eyes of a chameleon move independently of each other.",
  "Flamingos are pink because of the carotenoids in their diet.",
  "The feathers of a peacock are not actually blue but appear so due to light reflection.",
  "A group of crows is called a murder.",
  "The kiwi bird is the only bird with nostrils at the tip of its beak.",
  "Platypuses can detect electrical signals from their prey.",
  "The wood frog can survive being frozen for months.",
  "A group of rhinoceroses is called a crash.",
  "The anaconda is the heaviest snake in the world.",
  "The basilisk lizard can run on water.",
  "The wings of a dragonfly can beat 30 times per second.",
  "Tarantulas can shoot tiny hairs to defend themselves.",
  "A baby panda is smaller than a stick of butter at birth.",
  "The naked mole rat can survive without oxygen for up to 18 minutes.",
  "The pangolin is the only mammal with scales.",
  "The proboscis monkey has a nose that can grow up to 7 inches long.",
  "The male seahorse carries and gives birth to offspring.",
  "An ostrich's kick can kill a lion.",
  "The only bird capable of hovering in place is the hummingbird.",
  "A group of bats is called a cauldron.",
  "Cows can recognize and remember the faces of up to 50 individuals.",
  "The horn of a rhinoceros is made of keratin, the same protein as human hair and nails.",
  "Camels can drink up to 40 gallons of water in one go.",
  "A group of ferrets is called a business.",
  "A narwhal's tusk is actually a tooth.",
  "The largest species of penguin, the emperor penguin, can weigh up to 88 pounds.",
  "The Galápagos tortoise can live for over 150 years.",
  "The komodo dragon can consume up to 80% of its body weight in one meal.",
  "The barnacle has the largest penis-to-body ratio of any animal.",
  "The common garden snail has about 14,000 teeth.",
  "The slowest fish in the world is the dwarf seahorse, which swims at about 5 feet per hour.",
  "The cassowary is considered the world's most dangerous bird.",
  "Electric rays can produce shocks of up to 220 volts.",
  "The vampire bat feeds on the blood of other animals.",
  "The blobfish is considered the world's ugliest animal.",
  "Polar bears are nearly invisible under infrared cameras.",
  "The okapi is the closest living relative of the giraffe.",
  "The Greenland shark is the longest-living vertebrate, with a lifespan of up to 400 years.",
  "The kakapo is the world's only flightless parrot.",
  "The quokka is known as the world's happiest animal due to its constant smile.",
  "Sea sponges are animals, not plants.",
  "The echidna has a four-headed penis.",
  "A single drop of seawater contains millions of microorganisms.",
  "The poison from a cone snail can be fatal to humans.",
  "Tuna can swim up to 43 miles per hour.",
  "The mantis shrimp can see 12 color channels, compared to humans' three.",
  "The peregrine falcon is the fastest animal on Earth, diving at speeds of up to 240 mph.",
  "The pufferfish inflates to scare predators and contains a toxin 1,200 times more lethal than cyanide.",
  "The axolotl remains in its larval stage for its entire life.",
  "A kangaroo's tail acts as a fifth limb when walking.",
  "The platypus does not have a stomach.",
  "A mole can dig a tunnel 300 feet long in a single night."
]
